In [1]:
#%pip install pandas

In [2]:
import pandas as pd

C:\Users\shaik\AppData\Local\Temp\ipykernel_6116\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
df = pd.read_csv("./Applicant-details.csv")

In [4]:
# size
df.shape

(100000, 13)

In [5]:
# how it looks
df.sample(5)

,Applicant_ID,Annual_Income,Applicant_Age,Work_Experience,Marital_Status,House_Ownership,Vehicle_Ownership(car),Occupation,Residence_City,Residence_State,Years_in_Current_Employment,Years_in_Current_Residence,Loan_Default_Risk
59809,3885,4942553,33,1,single,rented,no,Librarian,Mahbubnagar,Telangana,1,11,0
33440,9223,5633121,47,11,single,rented,no,Consultant,Kamarhati,West_Bengal,4,14,0
78288,54988,1735303,41,7,single,rented,no,Biomedical_Engineer,North_Dumdum,West_Bengal,7,11,0
14526,63355,8397564,71,0,single,rented,no,Designer,Raebareli,Uttar_Pradesh,0,12,0
23443,66951,2593784,66,1,single,rented,yes,Official,Muzaffarpur,Bihar,1,11,1

In [6]:
# columns types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 13 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Applicant_ID                 100000 non-null  int64
 1   Annual_Income                100000 non-null  int64
 2   Applicant_Age                100000 non-null  int64
 3   Work_Experience              100000 non-null  int64
 4   Marital_Status               100000 non-null  object
 5   House_Ownership              100000 non-null  object
 6   Vehicle_Ownership(car)       100000 non-null  object
 7   Occupation                   100000 non-null  object
 8   Residence_City               100000 non-null  object
 9   Residence_State              100000 non-null  object
 10  Years_in_Current_Employment  100000 non-null  int64
 11  Years_in_Current_Residence   100000 non-null  int64
 12  Loan_Default_Risk            100000 non-null  int64
dtypes: int64(7), object(6)
memory usage: 9.9+ MB

In [7]:
# in the above age can be converted to integer

In [8]:
# missing values

df.isnull().sum()

Applicant_ID                   0
Annual_Income                  0
Applicant_Age                  0
Work_Experience                0
Marital_Status                 0
House_Ownership                0
Vehicle_Ownership(car)         0
Occupation                     0
Residence_City                 0
Residence_State                0
Years_in_Current_Employment    0
Years_in_Current_Residence     0
Loan_Default_Risk              0
dtype: int64

In [9]:
# how does data look like mathematically

df.describe()

,Applicant_ID,Annual_Income,Applicant_Age,Work_Experience,Years_in_Current_Employment,Years_in_Current_Residence,Loan_Default_Risk
count,100000.000000,1.000000e+05,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000
mean,50000.500000,5.001617e+06,49.995400,10.110750,6.342990,11.996020,0.129970
std,28867.657797,2.876394e+06,17.056051,5.996007,3.644942,1.396826,0.336272
min,1.000000,1.031000e+04,21.000000,0.000000,0.000000,10.000000,0.000000
25%,25000.750000,2.507092e+06,35.000000,5.000000,4.000000,11.000000,0.000000
50%,50000.500000,5.004938e+06,50.000000,10.000000,6.000000,12.000000,0.000000
75%,75000.250000,7.477502e+06,65.000000,15.000000,9.000000,13.000000,0.000000
max,100000.000000,9.999180e+06,79.000000,20.000000,14.000000,14.000000,1.000000

In [10]:
# duplicate values
df.duplicated().sum()

0

In [11]:
numerical_columns = df.describe().columns

In [12]:
# correlation between the columns
df[numerical_columns].corr()["Loan_Default_Risk"]

Applicant_ID                  -0.021853
Annual_Income                 -0.003692
Applicant_Age                 -0.022074
Work_Experience               -0.026859
Years_in_Current_Employment   -0.004657
Years_in_Current_Residence    -0.003838
Loan_Default_Risk              1.000000
Name: Loan_Default_Risk, dtype: float64